app/controllers/citizens_controller.rb

SELECT `citizens`.id FROM `citizens` WHERE (`citizens`.`email` = BINARY 'dgaffney@bennington.edu' AND `citizens`.id <> 1) LIMIT 1
---
  def update
    @citizen = current_citizen
    @citizen.country = Country.find(params[:citizen][:country_id])
    @citizen.street = params[:citizen][:street]
    @citizen.street_2 = params[:citizen][:street_2]
    @citizen.postal = params[:citizen][:postal]
    @citizen.email = params[:citizen][:email]
    @citizen.bio = params[:citizen][:bio]
    if params[:region_named] && !@citizen.country.regions.collect{|region| region.name}.join(" ").include?(params[:region_named])

SELECT * FROM `citizens` WHERE (`citizens`.`id` = 1) LIMIT 1
---
  def county_select
    @region = Region.find(params[:id].gsub(/[\\|\"]/, "").to_i)
    render :update do |page|
      page.replace_html "citizen-main-constituencies-county", :partial => "/counties/county_select"
    end
  end

end
