app/controllers/citizens_controller.rb

  def create
    logout_keeping_session!
    @citizen = Citizen.new(params[:citizen])
    success = @citizen && @citizen.save
---
INSERT INTO `citizens` (`name`, `salt`, `region`, `created_at`, `crypted_password`, `remember_token_expires_at`, `postal`, `country`, `updated_at`, `street`, `remember_token`, `bio`, `login`, `email`) VALUES('', 'a779e566157f7f9f1c131ea3ece2a8ddfcdfff01', NULL, '2010-12-05 07:30:55', 'd32f0a204ea67f85f83a29b369afb9dde516d464', NULL, NULL, NULL, '2010-12-05 07:30:55', NULL, NULL, NULL, 'dgaff', 'dgaffney@bennington.edu')

  def update
    @citizen = current_citizen
    @citizen.country = Country.find(params[:citizen][:country_id])
    @citizen.update_attributes(params[:citizen])
    debugger
    if params[:region_named] && !@citizen.country.regions.collect{|region| region.name}.join(" ").include?(params[:region_named])
      @region = Region.new
      @region.name = params[:region_named]
      @region.country = Country.find(params[:citizen][:country_id])
      @region.save
---
SELECT * FROM `citizens` WHERE (`citizens`.`id` = 1) LIMIT 1
SELECT * FROM `counties` WHERE (`counties`.region_id = 1)
SELECT * FROM `countries` WHERE (`countries`.`id` = 206)
UPDATE `citizens` SET `updated_at` = '2010-12-06 04:13:19', `crypted_password` = '580c7ac1d1d64f0fe8a426e60d0d995966a52fa3' WHERE `id` = 1
SELECT * FROM `regions` WHERE (`regions`.country_id = 206)
INSERT INTO `counties` (`name`, `created_at`, `updated_at`, `region_id`) VALUES('Multnomah', '2010-12-06 00:47:32', '2010-12-06 00:47:32', NULL)
INSERT INTO `regions` (`name`, `created_at`, `updated_at`, `country_id`) VALUES('Oregon', '2010-12-05 09:59:25', '2010-12-05 09:59:25', NULL)
UPDATE `regions` SET `updated_at` = '2010-12-05 10:07:57', `country_id` = 214 WHERE `id` = 1

  def region_select
    @country = Country.find(params[:id])
---
SELECT * FROM `countries` WHERE (`countries`.`id` = 195)

  def county_select
    debugger
    @region = Region.find(params[:id].gsub(/[\\|\"]/, "").to_i)
    render :update do |page|
      page.replace_html "counties", :partial => "/counties/county_select"
    end
  end

end

---
SELECT * FROM `counties` WHERE (`counties`.region_id = 1)
SELECT * FROM `regions` WHERE (`regions`.`id` = 1)
SELECT count(*) AS count_all FROM `counties` WHERE (`counties`.region_id = 1)